Tareas/Entrega_tareas_2021/1001577699/posts/student_alcohol.org
#+TITLE: Student Alcohol Consumption
#+SETUPFILE: ~/Desktop/Metodos_Computacionales_taller/Tareas/Entrega_tareas_2021/1001577699/org-html-themes/org/theme-readtheorg-local.setup

* Overview
We first import the necessary libraries. Moreover, we add a ~sed~ command to properly format our dataframes in emacs:
#+begin_src ipython :session asession :exports code :results raw drawer
import pandas as pd
import numpy as np
from tabulate import tabulate
#+end_src

#+RESULTS:
:results:
# Out[155]:
:end:

#+NAME: test_org_post_clean
#+begin_src sh :results verbatim :var data="" :results output
echo "$data" | sed s/\^:\ \//g | grep -v "^$" | sed s/\'//g
#+end_src

#+RESULTS: test_org_post_clean

* Interesting puzzle
#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
array = np.array([1,2,3])
array[np.array([1,1,1])]
#+end_src

#+RESULTS:
:results:
# Out[156]:
array([2, 2, 2])
:end:

#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
df = pd.DataFrame({'X': [0, 7, 2, 0, 3, 4, 2, 5, 6, 0, 3, 4, 0]})

# get the indices of all zeros, add padding to the first entry
zero_indices = [-1] + list( df.apply(lambda row : int(row.name) if row.get('X') == 0 else None,
                                     axis='columns').dropna() )

zero_indices = np.array(zero_indices)

# function to be applied
# distance to the previous zero or the start of the list
indices = df.index
df['Y'] = indices - zero_indices[np.searchsorted(zero_indices - 1, indices) - 1]

# print(zero_indices[np.searchsorted(zero_indices - 1, indices) - 1])
tabulate(df, headers='keys', tablefmt='orgtbl', showindex='always')
#+end_src

#+RESULTS:
:results:
# Out[157]:
|    |   X |   Y |
|----+-----+-----|
|  0 |   0 |   0 |
|  1 |   7 |   1 |
|  2 |   2 |   2 |
|  3 |   0 |   0 |
|  4 |   3 |   1 |
|  5 |   4 |   2 |
|  6 |   2 |   3 |
|  7 |   5 |   4 |
|  8 |   6 |   5 |
|  9 |   0 |   0 |
| 10 |   3 |   1 |
| 11 |   4 |   2 |
| 12 |   0 |   0 |
:end:

