Tareas/Entrega_tareas_2021/1001577699/public/student_alcohol.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-09-15 Wed 21:07 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Student Alcohol Consumption</title>
<meta name="author" content="Juan David Salcedo Hernández" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Student Alcohol Consumption</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf47c4fa">1. Overview</a></li>
<li><a href="#orge379fc2">2. Interesting puzzle</a></li>
<li><a href="#orgb849b78">3. Alcohol</a></li>
<li><a href="#orgdd1ec54">4. The Alessandro Strumia problem</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgf47c4fa" class="outline-2">
<h2 id="orgf47c4fa"><span class="section-number-2">1</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
We first import the necessary libraries. Moreover, we add a <code>sed</code> command to properly format our dataframes in emacs:
</p>
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #ff79c6;">import</span> pandas <span style="color: #ff79c6;">as</span> pd
<span style="color: #ff79c6;">import</span> numpy <span style="color: #ff79c6;">as</span> np
<span style="color: #ff79c6;">from</span> tabulate <span style="color: #ff79c6;">import</span> tabulate
</pre>
</div>

<div class="org-src-container">
<pre class="src src-sh" id="org670754e"><span style="color: #bd93f9;">echo</span> <span style="color: #f1fa8c;">"</span><span style="color: #8be9fd;">$</span><span style="color: #f1fa8c;">data</span><span style="color: #f1fa8c;">"</span> | sed s/<span style="color: #f1fa8c;">\^</span>:<span style="color: #f1fa8c;">\ \/</span>/g | <span style="color: #bd93f9;">grep</span> -v <span style="color: #f1fa8c;">"^$"</span> | sed s/<span style="color: #f1fa8c;">\'</span>//g
</pre>
</div>
</div>
</div>

<div id="outline-container-orge379fc2" class="outline-2">
<h2 id="orge379fc2"><span class="section-number-2">2</span> Interesting puzzle</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-ipython">array = np.array([<span style="color: #bd93f9; font-weight: bold;">1</span>,<span style="color: #bd93f9; font-weight: bold;">2</span>,<span style="color: #bd93f9; font-weight: bold;">3</span>])
array[np.array([<span style="color: #bd93f9; font-weight: bold;">1</span>,<span style="color: #bd93f9; font-weight: bold;">1</span>,<span style="color: #bd93f9; font-weight: bold;">1</span>])]
</pre>
</div>

<p>
array([2, 2, 2])
</p>

<div class="org-src-container">
<pre class="src src-ipython">df = pd.DataFrame({<span style="color: #f1fa8c;">'X'</span>: [<span style="color: #bd93f9; font-weight: bold;">0</span>, <span style="color: #bd93f9; font-weight: bold;">7</span>, <span style="color: #bd93f9; font-weight: bold;">2</span>, <span style="color: #bd93f9; font-weight: bold;">0</span>, <span style="color: #bd93f9; font-weight: bold;">3</span>, <span style="color: #bd93f9; font-weight: bold;">4</span>, <span style="color: #bd93f9; font-weight: bold;">2</span>, <span style="color: #bd93f9; font-weight: bold;">5</span>, <span style="color: #bd93f9; font-weight: bold;">6</span>, <span style="color: #bd93f9; font-weight: bold;">0</span>, <span style="color: #bd93f9; font-weight: bold;">3</span>, <span style="color: #bd93f9; font-weight: bold;">4</span>, <span style="color: #bd93f9; font-weight: bold;">0</span>]})

<span style="color: #6272a4;"># </span><span style="color: #6272a4;">get the indices of all zeros, add padding to the first entry</span>
zero_indices = [-<span style="color: #bd93f9; font-weight: bold;">1</span>] + <span style="color: #ffb86c;">list</span>( df.<span style="color: #ffb86c;">apply</span>(<span style="color: #ff79c6;">lambda</span> row : <span style="color: #ffb86c;">int</span>(row.name) <span style="color: #ff79c6;">if</span> row.get(<span style="color: #f1fa8c;">'X'</span>) == <span style="color: #bd93f9; font-weight: bold;">0</span> <span style="color: #ff79c6;">else</span> <span style="color: #8be9fd;">None</span>,
                                     axis=<span style="color: #f1fa8c;">'columns'</span>).dropna() )

zero_indices = np.array(zero_indices)

<span style="color: #6272a4;"># </span><span style="color: #6272a4;">function to be applied</span>
<span style="color: #6272a4;"># </span><span style="color: #6272a4;">distance to the previous zero or the start of the list</span>
indices = df.index
df[<span style="color: #f1fa8c;">'Y'</span>] = indices - zero_indices[np.searchsorted(zero_indices - <span style="color: #bd93f9; font-weight: bold;">1</span>, indices) - <span style="color: #bd93f9; font-weight: bold;">1</span>]

<span style="color: #6272a4;"># </span><span style="color: #6272a4;">print(zero_indices[np.searchsorted(zero_indices - 1, indices) - 1])</span>
tabulate(df, headers=<span style="color: #f1fa8c;">'keys'</span>, tablefmt=<span style="color: #f1fa8c;">'orgtbl'</span>, showindex=<span style="color: #f1fa8c;">'always'</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-right">X</th>
<th scope="col" class="org-right">Y</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">7</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-right">5</td>
<td class="org-right">4</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-right">6</td>
<td class="org-right">5</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
</div>
</div>
