Tareas/Entrega_tareas_2021/1001577699/posts/student_alcohol.org
* Alcohol
Now we import the dataset from a spceific web address and assign it to a dataframe.
#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
path = 'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv'
df = pd.read_csv(path)

tabulate(df.head(), headers='keys', tablefmt='orgtbl', showindex='always')
#+end_src

#+RESULTS:
:results:
# Out[158]:
|    | school   | sex   |   age | address   | famsize   | Pstatus   |   Medu |   Fedu | Mjob    | Fjob     | reason   | guardian   |   traveltime |   studytime |   failures | schoolsup   | famsup   | paid   | activities   | nursery   | higher   | internet   | romantic   |   famrel |   freetime |   goout |   Dalc |   Walc |   health |   absences |   G1 |   G2 |   G3 |
|----+----------+-------+-------+-----------+-----------+-----------+--------+--------+---------+----------+----------+------------+--------------+-------------+------------+-------------+----------+--------+--------------+-----------+----------+------------+------------+----------+------------+---------+--------+--------+----------+------------+------+------+------|
|  0 | GP       | F     |    18 | U         | GT3       | A         |      4 |      4 | at_home | teacher  | course   | mother     |            2 |           2 |          0 | yes         | no       | no     | no           | yes       | yes      | no         | no         |        4 |          3 |       4 |      1 |      1 |        3 |          6 |    5 |    6 |    6 |
|  1 | GP       | F     |    17 | U         | GT3       | T         |      1 |      1 | at_home | other    | course   | father     |            1 |           2 |          0 | no          | yes      | no     | no           | no        | yes      | yes        | no         |        5 |          3 |       3 |      1 |      1 |        3 |          4 |    5 |    5 |    6 |
|  2 | GP       | F     |    15 | U         | LE3       | T         |      1 |      1 | at_home | other    | other    | mother     |            1 |           2 |          3 | yes         | no       | yes    | no           | yes       | yes      | yes        | no         |        4 |          3 |       2 |      2 |      3 |        3 |         10 |    7 |    8 |   10 |
|  3 | GP       | F     |    15 | U         | GT3       | T         |      4 |      2 | health  | services | home     | mother     |            1 |           3 |          0 | no          | yes      | yes    | yes          | yes       | yes      | yes        | yes        |        3 |          2 |       2 |      1 |      1 |        5 |          2 |   15 |   14 |   15 |
|  4 | GP       | F     |    16 | U         | GT3       | T         |      3 |      3 | other   | other    | home     | father     |            1 |           2 |          0 | no          | yes      | yes    | no           | yes       | yes      | no         | no         |        4 |          3 |       2 |      1 |      2 |        5 |          4 |    6 |   10 |   10 |
:end:

We wish to clean the dataframe by slicing it from the school until the guardian column.
#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
df = df.loc[:, 'school':'guardian']
tabulate(df.head(), headers='keys', tablefmt='orgtbl', showindex='always')
#+end_src

#+RESULTS:
:results:
# Out[36]:
|    | school   | sex   |   age | address   | famsize   | Pstatus   |   Medu |   Fedu | Mjob    | Fjob     | reason   | guardian   |
|----+----------+-------+-------+-----------+-----------+-----------+--------+--------+---------+----------+----------+------------|
|  0 | GP       | F     |    18 | U         | GT3       | A         |      4 |      4 | at_home | teacher  | course   | mother     |
|  1 | GP       | F     |    17 | U         | GT3       | T         |      1 |      1 | at_home | other    | course   | father     |
|  2 | GP       | F     |    15 | U         | LE3       | T         |      1 |      1 | at_home | other    | other    | mother     |
|  3 | GP       | F     |    15 | U         | GT3       | T         |      4 |      2 | health  | services | home     | mother     |
|  4 | GP       | F     |    16 | U         | GT3       | T         |      3 |      3 | other   | other    | home     | father     |
:end:

Capitalise strings from the Mjob and Fjob columns
#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
capitaliser = lambda x : str(x).capitalize()
df['Mjob'] = df['Mjob'].apply(capitaliser)
df['Fjob'] = df['Fjob'].apply(capitaliser)

tabulate(df.head(), headers='keys', tablefmt='orgtbl', showindex='always')
#+end_src

#+RESULTS:
:results:
# Out[37]:
|    | school   | sex   |   age | address   | famsize   | Pstatus   |   Medu |   Fedu | Mjob    | Fjob     | reason   | guardian   |
|----+----------+-------+-------+-----------+-----------+-----------+--------+--------+---------+----------+----------+------------|
|  0 | GP       | F     |    18 | U         | GT3       | A         |      4 |      4 | At_home | Teacher  | course   | mother     |
|  1 | GP       | F     |    17 | U         | GT3       | T         |      1 |      1 | At_home | Other    | course   | father     |
|  2 | GP       | F     |    15 | U         | LE3       | T         |      1 |      1 | At_home | Other    | other    | mother     |
|  3 | GP       | F     |    15 | U         | GT3       | T         |      4 |      2 | Health  | Services | home     | mother     |
|  4 | GP       | F     |    16 | U         | GT3       | T         |      3 |      3 | Other   | Other    | home     | father     |
:end:

Printing the last elements of the dataset
#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
last_ones = df.iloc[[-1]]

tabulate(last_ones, headers='keys', tablefmt='orgtbl', showindex='always')
#+end_src

#+RESULTS:
:results:
# Out[38]:
|     | school   | sex   |   age | address   | famsize   | Pstatus   |   Medu |   Fedu | Mjob   | Fjob    | reason   | guardian   |
|-----+----------+-------+-------+-----------+-----------+-----------+--------+--------+--------+---------+----------+------------|
| 394 | MS       | M     |    19 | U         | LE3       | T         |      1 |      1 | Other  | At_home | course   | father     |
:end:

Adding new column conforming to some boolean value and multipying each numerical value by 10
#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
# one possiblity
df['legal_drinker'] = df.apply(lambda row :
                               bool(row.get('age') > 17),
                               axis = 'columns')

tabulate(df.head(), headers='keys', tablefmt='orgtbl', showindex='always')
#+end_src

#+RESULTS:
:results:
# Out[39]:
|    | school   | sex   |   age | address   | famsize   | Pstatus   |   Medu |   Fedu | Mjob    | Fjob     | reason   | guardian   | legal_drinker   |
|----+----------+-------+-------+-----------+-----------+-----------+--------+--------+---------+----------+----------+------------+-----------------|
|  0 | GP       | F     |    18 | U         | GT3       | A         |      4 |      4 | At_home | Teacher  | course   | mother     | True            |
|  1 | GP       | F     |    17 | U         | GT3       | T         |      1 |      1 | At_home | Other    | course   | father     | False           |
|  2 | GP       | F     |    15 | U         | LE3       | T         |      1 |      1 | At_home | Other    | other    | mother     | False           |
|  3 | GP       | F     |    15 | U         | GT3       | T         |      4 |      2 | Health  | Services | home     | mother     | False           |
|  4 | GP       | F     |    16 | U         | GT3       | T         |      3 |      3 | Other   | Other    | home     | father     | False           |
:end:

#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
df = df.applymap(lambda instance :
                 instance*10 if type(instance) == int else instance)
tabulate(df.head(), headers='keys', tablefmt='orgtbl', showindex='always')
#+end_src

#+RESULTS:
:results:
# Out[40]:
|    | school   | sex   |   age | address   | famsize   | Pstatus   |   Medu |   Fedu | Mjob    | Fjob     | reason   | guardian   | legal_drinker   |
|----+----------+-------+-------+-----------+-----------+-----------+--------+--------+---------+----------+----------+------------+-----------------|
|  0 | GP       | F     |   180 | U         | GT3       | A         |     40 |     40 | At_home | Teacher  | course   | mother     | True            |
|  1 | GP       | F     |   170 | U         | GT3       | T         |     10 |     10 | At_home | Other    | course   | father     | False           |
|  2 | GP       | F     |   150 | U         | LE3       | T         |     10 |     10 | At_home | Other    | other    | mother     | False           |
|  3 | GP       | F     |   150 | U         | GT3       | T         |     40 |     20 | Health  | Services | home     | mother     | False           |
|  4 | GP       | F     |   160 | U         | GT3       | T         |     30 |     30 | Other   | Other    | home     | father     | False           |
:end:

