Tareas/Entrega_tareas_2021/1001577699/public/student_alcohol.html

<div id="outline-container-orgb849b78" class="outline-2">
<h2 id="orgb849b78"><span class="section-number-2">3</span> Alcohol</h2>
<div class="outline-text-2" id="text-3">
<p>
Now we import the dataset from a spceific web address and assign it to a dataframe.
</p>
<div class="org-src-container">
<pre class="src src-ipython">path = <span style="color: #f1fa8c;">'https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv'</span>
df = pd.read_csv(path)

tabulate(df.head(), headers=<span style="color: #f1fa8c;">'keys'</span>, tablefmt=<span style="color: #f1fa8c;">'orgtbl'</span>, showindex=<span style="color: #f1fa8c;">'always'</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">school</th>
<th scope="col" class="org-left">sex</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-left">address</th>
<th scope="col" class="org-left">famsize</th>
<th scope="col" class="org-left">Pstatus</th>
<th scope="col" class="org-right">Medu</th>
<th scope="col" class="org-right">Fedu</th>
<th scope="col" class="org-left">Mjob</th>
<th scope="col" class="org-left">Fjob</th>
<th scope="col" class="org-left">reason</th>
<th scope="col" class="org-left">guardian</th>
<th scope="col" class="org-right">traveltime</th>
<th scope="col" class="org-right">studytime</th>
<th scope="col" class="org-right">failures</th>
<th scope="col" class="org-left">schoolsup</th>
<th scope="col" class="org-left">famsup</th>
<th scope="col" class="org-left">paid</th>
<th scope="col" class="org-left">activities</th>
<th scope="col" class="org-left">nursery</th>
<th scope="col" class="org-left">higher</th>
<th scope="col" class="org-left">internet</th>
<th scope="col" class="org-left">romantic</th>
<th scope="col" class="org-right">famrel</th>
<th scope="col" class="org-right">freetime</th>
<th scope="col" class="org-right">goout</th>
<th scope="col" class="org-right">Dalc</th>
<th scope="col" class="org-right">Walc</th>
<th scope="col" class="org-right">health</th>
<th scope="col" class="org-right">absences</th>
<th scope="col" class="org-right">G1</th>
<th scope="col" class="org-right">G2</th>
<th scope="col" class="org-right">G3</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">18</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">A</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-left">at<sub>home</sub></td>
<td class="org-left">teacher</td>
<td class="org-left">course</td>
<td class="org-left">mother</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">0</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">6</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">17</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">at<sub>home</sub></td>
<td class="org-left">other</td>
<td class="org-left">course</td>
<td class="org-left">father</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">0</td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-right">5</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">4</td>
<td class="org-right">5</td>
<td class="org-right">5</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">15</td>
<td class="org-left">U</td>
<td class="org-left">LE3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">at<sub>home</sub></td>
<td class="org-left">other</td>
<td class="org-left">other</td>
<td class="org-left">mother</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-right">10</td>
<td class="org-right">7</td>
<td class="org-right">8</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">15</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-left">health</td>
<td class="org-left">services</td>
<td class="org-left">home</td>
<td class="org-left">mother</td>
<td class="org-right">1</td>
<td class="org-right">3</td>
<td class="org-right">0</td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-right">5</td>
<td class="org-right">2</td>
<td class="org-right">15</td>
<td class="org-right">14</td>
<td class="org-right">15</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">16</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-left">other</td>
<td class="org-left">other</td>
<td class="org-left">home</td>
<td class="org-left">father</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">0</td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">yes</td>
<td class="org-left">yes</td>
<td class="org-left">no</td>
<td class="org-left">no</td>
<td class="org-right">4</td>
<td class="org-right">3</td>
<td class="org-right">2</td>
<td class="org-right">1</td>
<td class="org-right">2</td>
<td class="org-right">5</td>
<td class="org-right">4</td>
<td class="org-right">6</td>
<td class="org-right">10</td>
<td class="org-right">10</td>
</tr>
</tbody>
</table>

<p>
We wish to clean the dataframe by slicing it from the school until the guardian column.
</p>
<div class="org-src-container">
<pre class="src src-ipython">df = df.loc[:, <span style="color: #f1fa8c;">'school'</span>:<span style="color: #f1fa8c;">'guardian'</span>]
tabulate(df.head(), headers=<span style="color: #f1fa8c;">'keys'</span>, tablefmt=<span style="color: #f1fa8c;">'orgtbl'</span>, showindex=<span style="color: #f1fa8c;">'always'</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">school</th>
<th scope="col" class="org-left">sex</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-left">address</th>
<th scope="col" class="org-left">famsize</th>
<th scope="col" class="org-left">Pstatus</th>
<th scope="col" class="org-right">Medu</th>
<th scope="col" class="org-right">Fedu</th>
<th scope="col" class="org-left">Mjob</th>
<th scope="col" class="org-left">Fjob</th>
<th scope="col" class="org-left">reason</th>
<th scope="col" class="org-left">guardian</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">18</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">A</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-left">at<sub>home</sub></td>
<td class="org-left">teacher</td>
<td class="org-left">course</td>
<td class="org-left">mother</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">17</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">at<sub>home</sub></td>
<td class="org-left">other</td>
<td class="org-left">course</td>
<td class="org-left">father</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">15</td>
<td class="org-left">U</td>
<td class="org-left">LE3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">at<sub>home</sub></td>
<td class="org-left">other</td>
<td class="org-left">other</td>
<td class="org-left">mother</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">15</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-left">health</td>
<td class="org-left">services</td>
<td class="org-left">home</td>
<td class="org-left">mother</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">16</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-left">other</td>
<td class="org-left">other</td>
<td class="org-left">home</td>
<td class="org-left">father</td>
</tr>
</tbody>
</table>

<p>
Capitalise strings from the Mjob and Fjob columns
</p>
<div class="org-src-container">
<pre class="src src-ipython">capitaliser = <span style="color: #ff79c6;">lambda</span> x : <span style="color: #ffb86c;">str</span>(x).capitalize()
df[<span style="color: #f1fa8c;">'Mjob'</span>] = df[<span style="color: #f1fa8c;">'Mjob'</span>].<span style="color: #ffb86c;">apply</span>(capitaliser)
df[<span style="color: #f1fa8c;">'Fjob'</span>] = df[<span style="color: #f1fa8c;">'Fjob'</span>].<span style="color: #ffb86c;">apply</span>(capitaliser)

tabulate(df.head(), headers=<span style="color: #f1fa8c;">'keys'</span>, tablefmt=<span style="color: #f1fa8c;">'orgtbl'</span>, showindex=<span style="color: #f1fa8c;">'always'</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">school</th>
<th scope="col" class="org-left">sex</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-left">address</th>
<th scope="col" class="org-left">famsize</th>
<th scope="col" class="org-left">Pstatus</th>
<th scope="col" class="org-right">Medu</th>
<th scope="col" class="org-right">Fedu</th>
<th scope="col" class="org-left">Mjob</th>
<th scope="col" class="org-left">Fjob</th>
<th scope="col" class="org-left">reason</th>
<th scope="col" class="org-left">guardian</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">18</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">A</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Teacher</td>
<td class="org-left">course</td>
<td class="org-left">mother</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">17</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Other</td>
<td class="org-left">course</td>
<td class="org-left">father</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">15</td>
<td class="org-left">U</td>
<td class="org-left">LE3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Other</td>
<td class="org-left">other</td>
<td class="org-left">mother</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">15</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-left">Health</td>
<td class="org-left">Services</td>
<td class="org-left">home</td>
<td class="org-left">mother</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">16</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-left">Other</td>
<td class="org-left">Other</td>
<td class="org-left">home</td>
<td class="org-left">father</td>
</tr>
</tbody>
</table>

<p>
Printing the last elements of the dataset
</p>
<div class="org-src-container">
<pre class="src src-ipython">last_ones = df.iloc[[-<span style="color: #bd93f9; font-weight: bold;">1</span>]]

tabulate(last_ones, headers=<span style="color: #f1fa8c;">'keys'</span>, tablefmt=<span style="color: #f1fa8c;">'orgtbl'</span>, showindex=<span style="color: #f1fa8c;">'always'</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">school</th>
<th scope="col" class="org-left">sex</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-left">address</th>
<th scope="col" class="org-left">famsize</th>
<th scope="col" class="org-left">Pstatus</th>
<th scope="col" class="org-right">Medu</th>
<th scope="col" class="org-right">Fedu</th>
<th scope="col" class="org-left">Mjob</th>
<th scope="col" class="org-left">Fjob</th>
<th scope="col" class="org-left">reason</th>
<th scope="col" class="org-left">guardian</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">394</td>
<td class="org-left">MS</td>
<td class="org-left">M</td>
<td class="org-right">19</td>
<td class="org-left">U</td>
<td class="org-left">LE3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">Other</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">course</td>
<td class="org-left">father</td>
</tr>
</tbody>
</table>

<p>
Adding new column conforming to some boolean value and multipying each numerical value by 10
</p>
<div class="org-src-container">
<pre class="src src-ipython"><span style="color: #6272a4;"># </span><span style="color: #6272a4;">one possiblity</span>
df[<span style="color: #f1fa8c;">'legal_drinker'</span>] = df.<span style="color: #ffb86c;">apply</span>(<span style="color: #ff79c6;">lambda</span> row :
                               <span style="color: #ffb86c;">bool</span>(row.get(<span style="color: #f1fa8c;">'age'</span>) &gt; <span style="color: #bd93f9; font-weight: bold;">17</span>),
                               axis = <span style="color: #f1fa8c;">'columns'</span>)

tabulate(df.head(), headers=<span style="color: #f1fa8c;">'keys'</span>, tablefmt=<span style="color: #f1fa8c;">'orgtbl'</span>, showindex=<span style="color: #f1fa8c;">'always'</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">school</th>
<th scope="col" class="org-left">sex</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-left">address</th>
<th scope="col" class="org-left">famsize</th>
<th scope="col" class="org-left">Pstatus</th>
<th scope="col" class="org-right">Medu</th>
<th scope="col" class="org-right">Fedu</th>
<th scope="col" class="org-left">Mjob</th>
<th scope="col" class="org-left">Fjob</th>
<th scope="col" class="org-left">reason</th>
<th scope="col" class="org-left">guardian</th>
<th scope="col" class="org-left">legal<sub>drinker</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">18</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">A</td>
<td class="org-right">4</td>
<td class="org-right">4</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Teacher</td>
<td class="org-left">course</td>
<td class="org-left">mother</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">17</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Other</td>
<td class="org-left">course</td>
<td class="org-left">father</td>
<td class="org-left">False</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">15</td>
<td class="org-left">U</td>
<td class="org-left">LE3</td>
<td class="org-left">T</td>
<td class="org-right">1</td>
<td class="org-right">1</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Other</td>
<td class="org-left">other</td>
<td class="org-left">mother</td>
<td class="org-left">False</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">15</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">4</td>
<td class="org-right">2</td>
<td class="org-left">Health</td>
<td class="org-left">Services</td>
<td class="org-left">home</td>
<td class="org-left">mother</td>
<td class="org-left">False</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">16</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">3</td>
<td class="org-right">3</td>
<td class="org-left">Other</td>
<td class="org-left">Other</td>
<td class="org-left">home</td>
<td class="org-left">father</td>
<td class="org-left">False</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-ipython">df = df.applymap(<span style="color: #ff79c6;">lambda</span> instance :
                 instance*<span style="color: #bd93f9; font-weight: bold;">10</span> <span style="color: #ff79c6;">if</span> <span style="color: #ffb86c;">type</span>(instance) == <span style="color: #ffb86c;">int</span> <span style="color: #ff79c6;">else</span> instance)
tabulate(df.head(), headers=<span style="color: #f1fa8c;">'keys'</span>, tablefmt=<span style="color: #f1fa8c;">'orgtbl'</span>, showindex=<span style="color: #f1fa8c;">'always'</span>)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">school</th>
<th scope="col" class="org-left">sex</th>
<th scope="col" class="org-right">age</th>
<th scope="col" class="org-left">address</th>
<th scope="col" class="org-left">famsize</th>
<th scope="col" class="org-left">Pstatus</th>
<th scope="col" class="org-right">Medu</th>
<th scope="col" class="org-right">Fedu</th>
<th scope="col" class="org-left">Mjob</th>
<th scope="col" class="org-left">Fjob</th>
<th scope="col" class="org-left">reason</th>
<th scope="col" class="org-left">guardian</th>
<th scope="col" class="org-left">legal<sub>drinker</sub></th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">180</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">A</td>
<td class="org-right">40</td>
<td class="org-right">40</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Teacher</td>
<td class="org-left">course</td>
<td class="org-left">mother</td>
<td class="org-left">True</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">170</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">10</td>
<td class="org-right">10</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Other</td>
<td class="org-left">course</td>
<td class="org-left">father</td>
<td class="org-left">False</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">150</td>
<td class="org-left">U</td>
<td class="org-left">LE3</td>
<td class="org-left">T</td>
<td class="org-right">10</td>
<td class="org-right">10</td>
<td class="org-left">At<sub>home</sub></td>
<td class="org-left">Other</td>
<td class="org-left">other</td>
<td class="org-left">mother</td>
<td class="org-left">False</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">150</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">40</td>
<td class="org-right">20</td>
<td class="org-left">Health</td>
<td class="org-left">Services</td>
<td class="org-left">home</td>
<td class="org-left">mother</td>
<td class="org-left">False</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">GP</td>
<td class="org-left">F</td>
<td class="org-right">160</td>
<td class="org-left">U</td>
<td class="org-left">GT3</td>
<td class="org-left">T</td>
<td class="org-right">30</td>
<td class="org-right">30</td>
<td class="org-left">Other</td>
<td class="org-left">Other</td>
<td class="org-left">home</td>
<td class="org-left">father</td>
<td class="org-left">False</td>
</tr>
</tbody>
</table>
</div>
</div>
