Tareas/Entrega_tareas_2021/1001577699/posts/student_alcohol.org
* The Alessandro Strumia problem
We read some random dataframe from a JSON file
#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
path = 'https://api.crossref.org/journals/1029-8479/works?rows=100'

df = pd.read_json(path).loc['items','message']
df = pd.DataFrame(df)

df['author'][2]
#+end_src

#+RESULTS:
:results:
# Out[182]:
#+BEGIN_EXAMPLE
  [{given: Tatsuo,
  family: Kobayashi,
  sequence: first,
  affiliation: []},
  {given: Koichi,
  family: Yoshioka,
  sequence: additional,
  affiliation: []}]
#+END_EXAMPLE
:end:

In just one apply, we need to extract the Dois of Davide Gaiotto's articles:
#+begin_src ipython :session asession :exports both :results raw drawer :display text/org :post test_org_post_clean(data=*this*)
def get_author(row):
    try:
        if any([ row.get('author')[i]['given'] == 'Tatsuo' and
                  row.get('author')[i]['family'] == 'Kobayashi'
                  for i in range(len(row.get('author'))) ]):
             return row.get('DOI')
        else:
             return None
    except KeyError:
        return None

#df = df.apply(lambda row :
#         row.get('DOI') if any(
#             [ row.get('author')[i]['given'] == 'Davide' and row.get('author')[i]['family'] == 'Gaiotto' for i in range( len(row.get('author')) ) ] )
#         else None, axis = 'columns').dropna()
df = df.apply(get_author, axis='columns').dropna()
df
#+end_src

#+RESULTS:
:results:
# Out[183]:
#+BEGIN_EXAMPLE
  2     10.1088/1126-6708/2004/11/024
  79    10.1088/1126-6708/2006/01/044
  dtype: object
#+END_EXAMPLE
:end:
